Revit 2027 API
ParameterTypeId.RbsHydraulicDiameterParam Property
 "Hydraulic Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsHydraulicDiameterParam { get; }
Public Shared ReadOnly Property RbsHydraulicDiameterParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsHydraulicDiameterParam {
	ForgeTypeId^ get ();
}
static member RbsHydraulicDiameterParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace